<?php

return [

    'cfg' => [
        'apihost' => 'api.gizwits.com',
        'appid' => '32b9ed0845dd4df5910ef8819f8022b7',
        'productkey' => 'b67bc47a0b3144cd8aeb8d76999e945f',
        'productsecret' => '1f10348fc7d14829b801352a0c24c67e',
    ],

    'device_type' => [
        //'前海自定电器类型' => [电器名，码库电器类型，码库键值，自定义键值[1开关12音量-])
        '1' => ['空调', 49152, 49153, 1],
        '2' => ['电视', 8192, 8193, 12],
        '3' => ['机顶盒', 16384, 16423, 12],
        '4' => ['投影仪', 40960, 40961, 1],
        //'5' => ['功放', 0, 0, 1],
        '6' => ['DVD', 24576, 24609, 1],
        '7' => ['电风扇', 32768, 32769, 1],
        //'8' => ['智能灯', 0, 0, 1]
    ],

    // 电器
    'electrical' => [
        // key代表电器类型，如49152表示空调
        // index代表操作位置，参考文档。

        '49152' => [
            ['index' => 4, 'custom' => [0, 1], 'kv' => 49153, 'name' => '电源'], //开、关 1开启
            ['index' => 6, 'custom' => [1, 2, 3, 4, 5], 'kv' => 49155, 'name' => '模式'], //自动、冷风、除湿、送风、制热
            ['index' => 1, 'custom' => [1, 2, 3, 4], 'kv' => 49157, 'name' => '风速'], //自动、低、中、高
            ['index' => 2, 'custom' => [1, 2, 3], 'kv' => 49159, 'name' => '风向'], //上、中、下
            ['index' => 3, 'custom' => [0, 1], 'kv' => 49161, 'name' => '自动风向'], //开、关 1开启
            ['index' => 0, 'action' => '+', 'custom' => [1], 'kv' => 49163, 'name' => '温度+'], //
            ['index' => 0, 'action' => '-', 'custom' => [1], 'kv' => 49165, 'name' => '温度-'], //
            ['index' => 5, 'custom' => [0], 'kv' => 49165, 'name' => '温度-'], //键名
        ],
        //电视
        '8192' => [
            ['custom' => 12, 'kv' => 8193, 'name' => '音量-'],//
            ['custom' => -1, 'kv' => 8195, 'name' => '频道+'],//上
            ['custom' => 3, 'kv' => 8197, 'name' => '菜单'],//
            ['custom' => -1, 'kv' => 8199, 'name' => '频道-'],//下
            ['custom' => 11, 'kv' => 8201, 'name' => '音量+'],//
            ['custom' => 1, 'kv' => 8203, 'name' => '电源'],//
            ['custom' => 10, 'kv' => 8205, 'name' => '静音'],//
            ['custom' => 33, 'kv' => 8207, 'name' => '1'],//
            ['custom' => 34, 'kv' => 8209, 'name' => '2'],//
            ['custom' => 35, 'kv' => 8211, 'name' => '3'],//
            ['custom' => 36, 'kv' => 8213, 'name' => '4'],//
            ['custom' => 37, 'kv' => 8215, 'name' => '5'],//
            ['custom' => 38, 'kv' => 8217, 'name' => '6'],//
            ['custom' => 39, 'kv' => 8219, 'name' => '7'],//
            ['custom' => 40, 'kv' => 8221, 'name' => '8'],//
            ['custom' => 41, 'kv' => 8223, 'name' => '9'],//
            ['custom' => 44, 'kv' => 8225, 'name' => '-/--'],//
            ['custom' => 32, 'kv' => 8227, 'name' => '0'],//
            ['custom' => 13, 'kv' => 8229, 'name' => 'AV/TV'],//
            ['custom' => 4, 'kv' => 8231, 'name' => '返回'],//
            ['custom' => 9, 'kv' => 8233, 'name' => 'OK'],//
            ['custom' => 5, 'kv' => 8235, 'name' => '上'],//
            ['custom' => 7, 'kv' => 8237, 'name' => '左'],//
            ['custom' => 8, 'kv' => 8239, 'name' => '右'],//
            ['custom' => 6, 'kv' => 8241, 'name' => '下']//
        ],
        //机顶盒
        '16384' => [
            ['custom' => 1, 'kv' => 16385, 'name' => '待机'],
            ['custom' => 33, 'kv' => 16387, 'name' => '1'],
            ['custom' => 34, 'kv' => 16389, 'name' => '2'],
            ['custom' => 35, 'kv' => 16391, 'name' => '3'],
            ['custom' => 36, 'kv' => 16393, 'name' => '4'],
            ['custom' => 37, 'kv' => 16395, 'name' => '5'],
            ['custom' => 38, 'kv' => 16397, 'name' => '6'],
            ['custom' => 39, 'kv' => 16399, 'name' => '7'],
            ['custom' => 40, 'kv' => 16401, 'name' => '8'],
            ['custom' => 41, 'kv' => 16403, 'name' => '9'],
            ['custom' => 13, 'kv' => 16405, 'name' => '向导'],
            ['custom' => 32, 'kv' => 16407, 'name' => '0'],
            ['custom' => 4, 'kv' => 16409, 'name' => '返回'],
            ['custom' => 5, 'kv' => 16411, 'name' => '上'],
            ['custom' => 7, 'kv' => 16413, 'name' => '左'],
            ['custom' => 9, 'kv' => 16415, 'name' => 'OK'],
            ['custom' => 8, 'kv' => 16417, 'name' => '右'],
            ['custom' => 6, 'kv' => 16419, 'name' => '下'],
            ['custom' => 11, 'kv' => 16421, 'name' => '音量+'],
            ['custom' => 12, 'kv' => 16423, 'name' => '音量-'],
            ['custom' => -1, 'kv' => 16425, 'name' => '频道+'],//上
            ['custom' => -1, 'kv' => 16427, 'name' => '频道-'],//下
            ['custom' => 3, 'kv' => 16429, 'name' => '菜单']
        ],
        //投影仪
        '40960' => [
            ['custom' => 1, 'kv' => 40961, 'name' => '开机'],
            ['custom' => 0, 'kv' => 40963, 'name' => '关机'],
            ['custom' => -1, 'kv' => 40965, 'name' => '电脑'],
            ['custom' => -1, 'kv' => 40967, 'name' => '视频'],
            ['custom' => 13, 'kv' => 40969, 'name' => '信号'],
            ['custom' => -1, 'kv' => 40971, 'name' => '变焦+'],
            ['custom' => -1, 'kv' => 40973, 'name' => '变焦-'],
            ['custom' => 14, 'kv' => 40975, 'name' => '画面+'],
            ['custom' => 15, 'kv' => 40977, 'name' => '画面-'],
            ['custom' => 3, 'kv' => 40979, 'name' => '菜单'],
            ['custom' => 9, 'kv' => 40981, 'name' => 'OK'],
            ['custom' => 5, 'kv' => 40983, 'name' => '上'],
            ['custom' => 7, 'kv' => 40985, 'name' => '左'],
            ['custom' => 8, 'kv' => 40987, 'name' => '右'],
            ['custom' => 6, 'kv' => 40989, 'name' => '下'],
            ['custom' => 4, 'kv' => 40991, 'name' => '退出'],
            ['custom' => 11, 'kv' => 40993, 'name' => '音量+'],
            ['custom' => 12, 'kv' => 40995, 'name' => '音量-'],
            ['custom' => -1, 'kv' => 40997, 'name' => '静音'],
            ['custom' => -1, 'kv' => 40999, 'name' => '自动'],
            ['custom' => -1, 'kv' => 41001, 'name' => '暂停'],
            ['custom' => -1, 'kv' => 41003, 'name' => '亮度']
        ],
        //影碟机
        '24576' => [
            ['custom' => 7, 'kv' => 24577, 'name' => '左'],
            ['custom' => 5, 'kv' => 24579, 'name' => '上'],
            ['custom' => 9, 'kv' => 24581, 'name' => 'OK'],
            ['custom' => 6, 'kv' => 24583, 'name' => '下'],
            ['custom' => 8, 'kv' => 24585, 'name' => '右'],
            ['custom' => 1, 'kv' => 24587, 'name' => '电源'],
            ['custom' => 10, 'kv' => 24589, 'name' => '静音'],
            ['custom' => 17, 'kv' => 24591, 'name' => '快退'],
            ['custom' => 13, 'kv' => 24593, 'name' => '播放'],
            ['custom' => 16, 'kv' => 24595, 'name' => '快进'],
            ['custom' => 18, 'kv' => 24597, 'name' => '上一曲'],
            ['custom' => 14, 'kv' => 24599, 'name' => '停止'],
            ['custom' => 19, 'kv' => 24601, 'name' => '下一曲'],
            ['custom' => -1, 'kv' => 24603, 'name' => '制式'],
            ['custom' => 15, 'kv' => 24605, 'name' => '暂停'],
            ['custom' => -1, 'kv' => 24607, 'name' => '标题'],
            ['custom' => 2, 'kv' => 24609, 'name' => '开关仓'],
            ['custom' => 3, 'kv' => 24611, 'name' => '菜单'],
            ['custom' => 4, 'kv' => 24613, 'name' => '返回']
        ],
        //风
        '32768' => [
            ['custom' => 1, 'kv' => 32769, 'name' => '电源'],
            ['custom' => 3, 'kv' => 32771, 'name' => '风速'],
            ['custom' => 2, 'kv' => 32773, 'name' => '摇头'],
            ['custom' => 6, 'kv' => 32775, 'name' => '模式'],//风类
            ['custom' => 5, 'kv' => 32777, 'name' => '定时'],
            ['custom' => -1, 'kv' => 32779, 'name' => '灯光'],
            ['custom' => -1, 'kv' => 32781, 'name' => '负离子'],
            ['custom' => -1, 'kv' => 32783, 'name' => '1'],
            ['custom' => -1, 'kv' => 32785, 'name' => '2'],
            ['custom' => -1, 'kv' => 32787, 'name' => '3'],
            ['custom' => -1, 'kv' => 32789, 'name' => '4'],
            ['custom' => -1, 'kv' => 32791, 'name' => '5'],
            ['custom' => -1, 'kv' => 32793, 'name' => '6'],
            ['custom' => -1, 'kv' => 32795, 'name' => '7'],
            ['custom' => -1, 'kv' => 32797, 'name' => '8'],
            ['custom' => -1, 'kv' => 32799, 'name' => '9'],
            ['custom' => -1, 'kv' => 32801, 'name' => '睡眠'],
            ['custom' => -1, 'kv' => 32803, 'name' => '制冷'],
            ['custom' => -1, 'kv' => 32805, 'name' => '风量'],
            ['custom' => 4, 'kv' => 32807, 'name' => '低'],//风速-
            ['custom' => -1, 'kv' => 32809, 'name' => '中'],
            ['custom' => 3, 'kv' => 32811, 'name' => '高'],//风速+
        ]
    ],


];
